

int[,] pic = new int[,]
{
{0, 0 ,1, 0, 1, 0, 1, 0}, 
{0, 0 ,1, 0, 1, 0, 1, 0},
{0, 0 ,1, 0, 1, 0, 1, 0},
{0, 0 ,1, 0, 1, 0, 1, 0}, 
{0, 0 ,1, 0, 1, 0, 1, 0},
{0, 0 ,1, 0, 1, 0, 1, 0},
{0, 0 ,1, 0, 1, 0, 1, 0}, 
{0, 0 ,1, 0, 1, 0, 1, 0},
{0, 0 ,1, 0, 1, 0, 1, 0},
{0, 0 ,1, 0, 1, 0, 1, 0}, 
{0, 0 ,1, 0, 1, 0, 1, 0},
{0, 0 ,1, 0, 1, 0, 1, 0},
};

void PrintImage(int[,] image)                 
 {
    for (int i = 0; i < image.GetLength(0); i++) 
   {
      for (int j = 0; j < image.GetLength(1); j++)
      {
           if (image[i,j] == 0) Console.Write($" ");   // если текущий элемент i.j совпадает с 0 то печатаем пробел
          else Console.Write("+");            // если нет то +
      }  
   }
 }
void FillImage(int row, int col)                // метод по закрашиванию аргумент строка и пиксель
{
    if(pic[row, col] == 0)              //если текущ пиксель  с указанной позиции равен 0 не закрашен
    {    
    pic[row, col] = 1;                   // я буду его красить 
    FillImage(row-1, col);                 //филимадж вызывает сам себя на строчку выше
    FillImage(row, col-1);              //в той же строке но влево
    FillImage(row+1, col);        // идем вниз
    FillImage(row, col-1);   // идем вправо оставаясь в той строке
}
}

PrintImage(pic);
FillImage(2, 2);
PrintImage(pic);
